Tekla.Structures.Drawing.DotPrintOutputType
The printer output type.

Tekla.Structures.Drawing.DotPrintOutputType.Printer
Printer output type.

Tekla.Structures.Drawing.DotPrintOutputType.PDF
PDF output type.

Tekla.Structures.Drawing.DotPrintOutputType.Plot
Plot output type.

Tekla.Structures.Drawing.DotPrintOutputType.Image
Image png output type.